{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-DISEASE",
    "2": "I-DISEASE",
    "3": "B-MEDICATION",
    "4": "I-MEDICATION",
    "5": "B-SYMPTOM",
    "6": "I-SYMPTOM",
    "7": "B-DOSAGE",
    "8": "I-DOSAGE",
    "9": "B-DATE",
    "10": "I-DATE",
    "11": "B-PROCEDURE",
    "12": "I-PROCEDURE",
    "13": "B-ANATOMY",
    "14": "I-ANATOMY",
    "15": "B-TEST",
    "16": "I-TEST"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ANATOMY": 13,
    "B-DATE": 9,
    "B-DISEASE": 1,
    "B-DOSAGE": 7,
    "B-MEDICATION": 3,
    "B-PROCEDURE": 11,
    "B-SYMPTOM": 5,
    "B-TEST": 15,
    "I-ANATOMY": 14,
    "I-DATE": 10,
    "I-DISEASE": 2,
    "I-DOSAGE": 8,
    "I-MEDICATION": 4,
    "I-PROCEDURE": 12,
    "I-SYMPTOM": 6,
    "I-TEST": 16,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
